sterentev/atdf-device-asm-include/inc/AT90PWM1.inc
; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
.equ	BLB0_MASK	= 0x0C		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB00		= 2		;          BLB0 BIT0 position
.equ	BLB1_MASK	= 0x30		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB10		= 4		;          BLB1 BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled
; ::::  BLB0	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Application Section
;			0x04		; LPM prohibited in Application Section
;			0x08		; SPM prohibited in Application Section
;			0x0C		; No lock on SPM and LPM in Application Section
; ::::  BLB1	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Boot Section
;			0x10		; LPM prohibited in Boot Section
;			0x20		; SPM prohibited in Boot Section
;			0x30		; No lock on SPM and LPM in Boot Section




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	PICR2		= 0xFE		; [MEMORY MAPPED] PSC 2 Input Capture Register 
.equ	PFRC2B		= 0xFD		; [MEMORY MAPPED] PSC 2 Input B Control
.equ	PFRC2A		= 0xFC		; [MEMORY MAPPED] PSC 2 Input B Control
.equ	PCTL2		= 0xFB		; [MEMORY MAPPED] PSC 2 Control Register
.equ	PCNF2		= 0xFA		; [MEMORY MAPPED] PSC 2 Configuration Register
.equ	OCR2RB		= 0xF8		; [MEMORY MAPPED] Output Compare RB Register 
.equ	OCR2SB		= 0xF6		; [MEMORY MAPPED] Output Compare SB Register 
.equ	OCR2RA		= 0xF4		; [MEMORY MAPPED] Output Compare RA Register 
.equ	OCR2SA		= 0xF2		; [MEMORY MAPPED] Output Compare SA Register 
.equ	POM2		= 0xF1		; [MEMORY MAPPED] PSC 2 Output Matrix
.equ	PSOC2		= 0xF0		; [MEMORY MAPPED] PSC2 Synchro and Output Configuration
.equ	PICR1		= 0xEE		; [MEMORY MAPPED] PSC 1 Input Capture Register 
.equ	PFRC1B		= 0xED		; [MEMORY MAPPED] PSC 1 Input B Control
.equ	PFRC1A		= 0xEC		; [MEMORY MAPPED] PSC 1 Input B Control
.equ	PCTL1		= 0xEB		; [MEMORY MAPPED] PSC 1 Control Register
.equ	PSOC1		= 0xE0		; [MEMORY MAPPED] PSC1 Synchro and Output Configuration
.equ	PICR0		= 0xDE		; [MEMORY MAPPED] PSC 0 Input Capture Register
.equ	PFRC0B		= 0xDD		; [MEMORY MAPPED] PSC 0 Input B Control
.equ	PFRC0A		= 0xDC		; [MEMORY MAPPED] PSC 0 Input A Control
.equ	PCTL0		= 0xDB		; [MEMORY MAPPED] PSC 0 Control Register
.equ	PCNF0		= 0xDA		; [MEMORY MAPPED] PSC 0 Configuration Register
.equ	OCR0RB		= 0xD8		; [MEMORY MAPPED] Output Compare RB Register 
.equ	OCR0SB		= 0xD6		; [MEMORY MAPPED] Output Compare SB Register 
.equ	OCR0RA		= 0xD4		; [MEMORY MAPPED] Output Compare RA Register 
.equ	OCR0SA		= 0xD2		; [MEMORY MAPPED] Output Compare SA Register 
.equ	PSOC0		= 0xD0		; [MEMORY MAPPED] PSC0 Synchro and Output Configuration
.equ	AC2CON		= 0xAF		; [MEMORY MAPPED] Analog Comparator 2 Control Register
.equ	AC0CON		= 0xAD		; [MEMORY MAPPED] Analog Comparator 0 Control Register
.equ	PIM2		= 0xA5		; [MEMORY MAPPED] PSC2 Interrupt Mask Register
.equ	PIFR2		= 0xA4		; [MEMORY MAPPED] PSC2 Interrupt Flag Register
.equ	PIM0		= 0xA1		; [MEMORY MAPPED] PSC0 Interrupt Mask Register
.equ	PIFR0		= 0xA0		; [MEMORY MAPPED] PSC0 Interrupt Flag Register
.equ	OCR1B		= 0x8A		; [MEMORY MAPPED] Timer/Counter1 Output Compare Register  Bytes
.equ	OCR1A		= 0x88		; [MEMORY MAPPED] Timer/Counter1 Output Compare Register Bytes
.equ	ICR1		= 0x86		; [MEMORY MAPPED] Timer/Counter1 Input Capture Register  Bytes
.equ	TCNT1		= 0x84		; [MEMORY MAPPED] Timer/Counter1 Bytes
.equ	TCCR1C		= 0x82		; [MEMORY MAPPED] Timer/Counter1 Control Register C
.equ	TCCR1B		= 0x81		; [MEMORY MAPPED] Timer/Counter1 Control Register B
.equ	TCCR1A		= 0x80		; [MEMORY MAPPED] Timer/Counter1 Control Register A
.equ	DIDR1		= 0x7F		; [MEMORY MAPPED] Digital Input Disable Register 1
.equ	DIDR0		= 0x7E		; [MEMORY MAPPED] Digital Input Disable Register 0
.equ	ADMUX		= 0x7C		; [MEMORY MAPPED] The ADC multiplexer Selection Register
.equ	ADCSRB		= 0x7B		; [MEMORY MAPPED] ADC Control and Status Register B
.equ	ADCSRA		= 0x7A		; [MEMORY MAPPED] The ADC Control and Status register
.equ	ADC		= 0x78		; [MEMORY MAPPED] ADC Data Register  Bytes
.equ	AMP1CSR		= 0x77		; [MEMORY MAPPED] 
.equ	AMP0CSR		= 0x76		; [MEMORY MAPPED] 
.equ	TIMSK1		= 0x6F		; [MEMORY MAPPED] Timer/Counter Interrupt Mask Register
.equ	TIMSK0		= 0x6E		; [MEMORY MAPPED] Timer/Counter0 Interrupt Mask Register
.equ	EICRA		= 0x69		; [MEMORY MAPPED] External Interrupt Control Register A
.equ	OSCCAL		= 0x66		; [MEMORY MAPPED] Oscillator Calibration Value
.equ	PRR		= 0x64		; [MEMORY MAPPED] Power Reduction Register
.equ	CLKPR		= 0x61		; [MEMORY MAPPED] 
.equ	WDTCSR		= 0x60		; [MEMORY MAPPED] Watchdog Timer Control Register
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; Stack Pointer 
.equ	SPMCSR		= 0x37		; Store Program Memory Control Register
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUSR		= 0x34		; MCU Status Register
.equ	SMCR		= 0x33		; Sleep Mode Control Register
.equ	ACSR		= 0x30		; Analog Comparator Status Register
.equ	SPDR		= 0x2E		; SPI Data Register
.equ	SPSR		= 0x2D		; SPI Status Register
.equ	SPCR		= 0x2C		; SPI Control Register
.equ	PLLCSR		= 0x29		; PLL Control And Status Register
.equ	OCR0B		= 0x28		; Timer/Counter0 Output Compare Register
.equ	OCR0A		= 0x27		; Timer/Counter0 Output Compare Register
.equ	TCNT0		= 0x26		; Timer/Counter0
.equ	TCCR0B		= 0x25		; Timer/Counter Control Register B
.equ	TCCR0A		= 0x24		; Timer/Counter  Control Register A
.equ	GTCCR		= 0x23		; General Timer/Counter Control Register
.equ	EEAR		= 0x21		; EEPROM Read/Write Access Bytes
.equ	EEDR		= 0x20		; EEPROM Data Register
.equ	EECR		= 0x1F		; EEPROM Control Register
.equ	GPIOR0		= 0x1E		; General Purpose IO Register 0
.equ	EIMSK		= 0x1D		; External Interrupt Mask Register
.equ	EIFR		= 0x1C		; External Interrupt Flag Register
.equ	GPIOR3		= 0x1B		; General Purpose IO Register 3
.equ	GPIOR2		= 0x1A		; General Purpose IO Register 2
.equ	GPIOR1		= 0x19		; General Purpose IO Register 1
.equ	TIFR1		= 0x16		; Timer/Counter Interrupt Flag register
.equ	TIFR0		= 0x15		; Timer/Counter0 Interrupt Flag register
.equ	PORTE		= 0x0E		; Port E Data Register
.equ	DDRE		= 0x0D		; Port E Data Direction Register
.equ	PINE		= 0x0C		; Port E Input Pins
.equ	PORTD		= 0x0B		; Port D Data Register
.equ	DDRD		= 0x0A		; Port D Data Direction Register
.equ	PIND		= 0x09		; Port D Input Pins
.equ	PORTB		= 0x05		; Port B Data Register
.equ	DDRB		= 0x04		; Port B Data Direction Register
.equ	PINB		= 0x03		; Port B Input Pins


; ====	BOOT_LOAD MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register SPMCSR bits		------------------------
.equ	SPMIE		= 7		; 0x80 - SPM Interrupt Enable
.equ	RWWSB		= 6		; 0x40 - Read While Write Section Busy
.equ	RWWSRE		= 4		; 0x10 - Read While Write section read enable
.equ	BLBSET		= 3		; 0x08 - Boot Lock Bit Set
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory Enable



