sterentev/atdf-device-asm-include/inc/AT90PWM1.inc
; ----------	Register PIFR2 bits		------------------------
.equ	PSEI2		= 5		; 0x20 - PSC 2 Synchro Error Interrupt
.equ	PEV2B		= 4		; 0x10 - External Event B Interrupt
.equ	PEV2A		= 3		; 0x08 - External Event A Interrupt
.equ	PRN2_MASK	= 0x06		;      - Ramp Number (2 bits)
.equ	PRN20		= 1		;          PRN2 BIT0 position
.equ	PEOP2		= 0		; 0x01 - End of PSC2 Interrupt
; ::::  PRN2	:::: bitfield values
;			0x00		; 1
;			0x02		; 2
;			0x04		; 3
;			0x06		; 4

; ----------	Register PFRC1B bits		------------------------
.equ	PCAE1B		= 7		; 0x80 - PSC 1 Capture Enable Input Part B
.equ	PISEL1B		= 6		; 0x40 - PSC 1 Input Select for Part B
.equ	PELEV1B		= 5		; 0x20 - PSC 1 Edge Level Selector on Input Part B
.equ	PFLTE1B		= 4		; 0x10 - PSC 1 Filter Enable on Input Part B
.equ	PRFM1B_MASK	= 0x0F		;      - PSC 1 Retrigger and Fault Mode for Part B (4 bits)
.equ	PRFM1B0		= 0		;          PRFM1B BIT0 position
; ::::  PRFM1B	:::: bitfield values
;			0x00		; No action, PSC Input is ignored
;			0x01		; Stop signal, Jump to Opposite Dead-Time and Wait
;			0x02		; Stop signal, Execute Opposite Dead-Time and Wait
;			0x03		; Stop signal, Execute Opposite while Fault active
;			0x04		; Deactivate outputs without changing timing.
;			0x05		; Stop signal and Insert Dead-Time
;			0x06		; Stop signal, Jump to Opposite Dead-Time and Wait.
;			0x07		; Halt PSC and Wait for Software Action
;			0x08		; Edge Retrigger PSC
;			0x09		; Fixed Frequency Edge Retrigger PSC
;			0x0A		; Reserved (do not use)
;			0x0B		; Reserved (do not use)
;			0x0C		; Reserved (do not use)
;			0x0D		; Reserved (do not use)
;			0x0E		; Fixed Frequency Edge Retrigger PSC and Deactivate Output
;			0x0F		; Reserved (do not use)

; ----------	Register PFRC1A bits		------------------------
.equ	PCAE1A		= 7		; 0x80 - PSC 1 Capture Enable Input Part A
.equ	PISEL1A		= 6		; 0x40 - PSC 1 Input Select for Part A
.equ	PELEV1A		= 5		; 0x20 - PSC 1 Edge Level Selector on Input Part A
.equ	PFLTE1A		= 4		; 0x10 - PSC 1 Filter Enable on Input Part A
.equ	PRFM1A_MASK	= 0x0F		;      - PSC 1 Retrigger and Fault Mode for Part A (4 bits)
.equ	PRFM1A0		= 0		;          PRFM1A BIT0 position
; ::::  PRFM1A	:::: bitfield values
;			0x00		; No action, PSC Input is ignored
;			0x01		; Stop signal, Jump to Opposite Dead-Time and Wait
;			0x02		; Stop signal, Execute Opposite Dead-Time and Wait
;			0x03		; Stop signal, Execute Opposite while Fault active
;			0x04		; Deactivate outputs without changing timing.
;			0x05		; Stop signal and Insert Dead-Time
;			0x06		; Stop signal, Jump to Opposite Dead-Time and Wait.
;			0x07		; Halt PSC and Wait for Software Action
;			0x08		; Edge Retrigger PSC
;			0x09		; Fixed Frequency Edge Retrigger PSC
;			0x0A		; Reserved (do not use)
;			0x0B		; Reserved (do not use)
;			0x0C		; Reserved (do not use)
;			0x0D		; Reserved (do not use)
;			0x0E		; Fixed Frequency Edge Retrigger PSC and Deactivate Output
;			0x0F		; Reserved (do not use)

; ----------	Register PCTL1 bits		------------------------
.equ	PPRE1_MASK	= 0xC0		;      - PSC 1 Prescaler Selects (2 bits)
.equ	PPRE10		= 6		;          PPRE1 BIT0 position
.equ	PBFM1		= 5		; 0x20 - Balance Flank Width Modulation
.equ	PAOC1B		= 4		; 0x10 - PSC 1 Asynchronous Output Control B
.equ	PAOC1A		= 3		; 0x08 - PSC 1 Asynchronous Output Control A
.equ	PARUN1		= 2		; 0x04 - PSC1 Auto Run
.equ	PCCYC1		= 1		; 0x02 - PSC1 Complete Cycle
.equ	PRUN1		= 0		; 0x01 - PSC 1 Run
; ::::  PPRE1	:::: bitfield values
;			0x00		; No divider on PSC input clock
;			0x40		; Divide the PSC input clock by 4
;			0x80		; Divide the PSC input clock by 16
;			0xC0		; Divide the PSC input clock by 64

; ----------	Register PSOC1 bits		------------------------
.equ	PSYNC1_MASK	= 0x30		;      - Synchronization Out for ADC Selection (2 bits)
.equ	PSYNC10		= 4		;          PSYNC1 BIT0 position
.equ	POEN1B		= 2		; 0x04 - PSCOUT11 Output Enable
.equ	POEN1A		= 0		; 0x01 - PSCOUT10 Output Enable
; ::::  PSYNC1	:::: bitfield values
;			0x00		; Send signal on leading edge of PSCOUTn0
;			0x10		; Send signal on trailing edge of PSCOUTn0
;			0x20		; Send signal on leading edge of PSCOUTn1
;			0x30		; Send signal on trailing edge of PSCOUTn1



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
.equ	SPIPS		= 7		; 0x80 - SPI Pin Select
.equ	PUD		= 4		; 0x10 - Pull-up disable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

; ----------	Register MCUSR bits		------------------------
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BORF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-on reset flag

; ----------	Register OSCCAL bits		------------------------
.equ	OSCCAL_MASK	= 0xFF		;      - Oscillator Calibration  (8 bits)
.equ	OSCCAL0		= 0		;          OSCCAL BIT0 position

; ----------	Register CLKPR bits		------------------------
.equ	CLKPCE		= 7		; 0x80 - 
.equ	CLKPS_MASK	= 0x0F		;      -  (4 bits)
.equ	CLKPS0		= 0		;          CLKPS BIT0 position
; ::::  CLKPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128
;			0x08		; 256

; ----------	Register SMCR bits		------------------------
.equ	SM_MASK		= 0x0E		;      - Sleep Mode Select bits (3 bits)
.equ	SM0		= 1		;          SM BIT0 position
.equ	SE		= 0		; 0x01 - Sleep Enable
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x02		; ADC Noise Reduction (If Available)
;			0x04		; Power Down
;			0x06		; Reserved
;			0x08		; Reserved
;			0x0A		; Reserved
;			0x0C		; Standby
;			0x0E		; Reserved

; ----------	Register GPIOR3 bits		------------------------
.equ	GPIOR_MASK	= 0xFF		;      - General Purpose IO Register 3 bis (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

