sterentev/atdf-device-asm-include/inc/AT90PWM1.inc
; ----------	Register ICR1 bits		------------------------
.equ	ICR1_MASK	= 0xFFFF	;      - Timer/Counter Input Capture (16 bits)
.equ	ICR10		= 0		;          ICR1 BIT0 position

; ----------	Register GTCCR bits		------------------------
;.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
;.equ	PSRSYNC		= 0		; 0x01 - Prescaler Reset Timer/Counter1 and Timer/Counter0



; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADMUX bits		------------------------
.equ	REFS_MASK	= 0xC0		;      - Reference Selection Bits (2 bits)
.equ	REFS0		= 6		;          REFS BIT0 position
.equ	ADLAR		= 5		; 0x20 - Left Adjust Result
.equ	MUX_MASK	= 0x0F		;      - Analog Channel and Gain Selection Bits (4 bits)
.equ	MUX0		= 0		;          MUX BIT0 position
; ::::  REFS	:::: bitfield values
;			0x00		; AREF, Internal Vref turned off
;			0x40		; AVCC with external capacitor at AREF pin
;			0x80		; Reserved
;			0xC0		; Internal 2.56V Voltage Reference with external capacitor at AREF pin

; ----------	Register ADCSRA bits		------------------------
.equ	ADEN		= 7		; 0x80 - ADC Enable
.equ	ADSC		= 6		; 0x40 - ADC Start Conversion
.equ	ADATE		= 5		; 0x20 - ADC Auto Trigger Enable
.equ	ADIF		= 4		; 0x10 - ADC Interrupt Flag
.equ	ADIE		= 3		; 0x08 - ADC Interrupt Enable
.equ	ADPS_MASK	= 0x07		;      - ADC  Prescaler Select Bits (3 bits)
.equ	ADPS0		= 0		;          ADPS BIT0 position

; ----------	Register ADCSRB bits		------------------------
.equ	ADHSM		= 7		; 0x80 - ADC High Speed Mode
.equ	ADASCR		= 4		; 0x10 - ADC Start Conversion
.equ	ADTS3		= 3		; 0x08 - ADC Auto Trigger Source Selection 3
.equ	ADTS2		= 2		; 0x04 - ADC Auto Trigger Source Selection 2
.equ	ADTS1		= 1		; 0x02 - ADC Auto Trigger Source Selection 1
.equ	ADTS0		= 0		; 0x01 - ADC Auto Trigger Source Selection 0

; ----------	Register DIDR0 bits		------------------------
.equ	ADC7D		= 7		; 0x80 - 
.equ	ADC6D		= 6		; 0x40 - 
.equ	ADC5D		= 5		; 0x20 - 
.equ	ADC4D		= 4		; 0x10 - 
.equ	ADC3D		= 3		; 0x08 - 
.equ	ADC2D		= 2		; 0x04 - 
.equ	ADC1D		= 1		; 0x02 - 
.equ	ADC0D		= 0		; 0x01 - 

; ----------	Register DIDR1 bits		------------------------
.equ	ACMP0D		= 5		; 0x20 - 
.equ	AMP0PD		= 4		; 0x10 - 
.equ	AMP0ND		= 3		; 0x08 - 
.equ	ADC10D		= 2		; 0x04 - 
.equ	ADC9D		= 1		; 0x02 - 
.equ	ADC8D		= 0		; 0x01 - 

; ----------	Register AMP0CSR bits		------------------------
.equ	AMP0EN		= 7		; 0x80 - 
.equ	AMP0IS		= 6		; 0x40 - 
.equ	AMP0G_MASK	= 0x30		;      -  (2 bits)
.equ	AMP0G0		= 4		;          AMP0G BIT0 position
.equ	AMP0TS_MASK	= 0x03		;      -  (2 bits)
.equ	AMP0TS0		= 0		;          AMP0TS BIT0 position

; ----------	Register AMP1CSR bits		------------------------
.equ	AMP1EN		= 7		; 0x80 - 
.equ	AMP1IS		= 6		; 0x40 - 
.equ	AMP1G_MASK	= 0x30		;      -  (2 bits)
.equ	AMP1G0		= 4		;          AMP1G BIT0 position
.equ	AMP1TS_MASK	= 0x03		;      -  (2 bits)
.equ	AMP1TS0		= 0		;          AMP1TS BIT0 position



; ====	SPI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SPCR bits		------------------------
.equ	SPIE		= 7		; 0x80 - SPI Interrupt Enable
.equ	SPE		= 6		; 0x40 - SPI Enable
.equ	DORD		= 5		; 0x20 - Data Order
.equ	MSTR		= 4		; 0x10 - Master/Slave Select
.equ	CPOL		= 3		; 0x08 - Clock polarity
.equ	CPHA		= 2		; 0x04 - Clock Phase
.equ	SPR_MASK	= 0x03		;      - SPI Clock Rate Selects (2 bits)
.equ	SPR0		= 0		;          SPR BIT0 position
; ::::  SPR	>>>> This is a part of COMM_SCK_RATE_3BIT enum (see complete values list below)

; ----------	Register SPSR bits		------------------------
.equ	SPIF		= 7		; 0x80 - SPI Interrupt Flag
.equ	WCOL		= 6		; 0x40 - Write Collision Flag
.equ	SPI2X		= 0		; 0x01 - Double SPI Speed Bit

; ----------	Register SPDR bits		------------------------
.equ	SPD_MASK	= 0xFF		;      - SPI Data (8 bits)
.equ	SPD0		= 0		;          SPD BIT0 position



; ====	WDT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register WDTCSR bits		------------------------
.equ	WDIF		= 7		; 0x80 - Watchdog Timeout Interrupt Flag
.equ	WDIE		= 6		; 0x40 - Watchdog Timeout Interrupt Enable
.equ	WDP_MASK	= 0x27		;      - Watchdog Timer Prescaler Bits (4 bits)
.equ	WDCE		= 4		; 0x10 - Watchdog Change Enable
.equ	WDE		= 3		; 0x08 - Watch Dog Enable
; ::::  WDP	:::: bitfield values
;			0x00		; Oscillator Cycles 2K
;			0x01		; Oscillator Cycles 4K
;			0x02		; Oscillator Cycles 8K
;			0x03		; Oscillator Cycles 16K
;			0x04		; Oscillator Cycles 32K
;			0x05		; Oscillator Cycles 64K
;			0x06		; Oscillator Cycles 128K
;			0x07		; Oscillator Cycles 256K
;			0x20		; Oscillator Cycles 512K
;			0x21		; Oscillator Cycles 1024K



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EICRA bits		------------------------
.equ	ISC3_MASK	= 0xC0		;      - External Interrupt Sense Control Bit (2 bits)
.equ	ISC30		= 6		;          ISC3 BIT0 position
.equ	ISC2_MASK	= 0x30		;      - External Interrupt Sense Control Bit (2 bits)
.equ	ISC20		= 4		;          ISC2 BIT0 position
.equ	ISC1_MASK	= 0x0C		;      - External Interrupt Sense Control Bit (2 bits)
.equ	ISC10		= 2		;          ISC1 BIT0 position
.equ	ISC0_MASK	= 0x03		;      - External Interrupt Sense Control Bit (2 bits)
.equ	ISC00		= 0		;          ISC0 BIT0 position
; ::::  ISC3	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x40		; Any Logical Change of INTX
;			0x80		; Falling Edge of INTX
;			0xC0		; Rising Edge of INTX
; ::::  ISC2	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x10		; Any Logical Change of INTX
;			0x20		; Falling Edge of INTX
;			0x30		; Rising Edge of INTX
; ::::  ISC1	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x04		; Any Logical Change of INTX
;			0x08		; Falling Edge of INTX
;			0x0C		; Rising Edge of INTX
; ::::  ISC0	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x01		; Any Logical Change of INTX
;			0x02		; Falling Edge of INTX
;			0x03		; Rising Edge of INTX

; ----------	Register EIMSK bits		------------------------
.equ	INT_MASK	= 0x0F		;      - External Interrupt Mask (4 bits)
.equ	INT0		= 0		;          INT BIT0 position

; ----------	Register EIFR bits		------------------------
.equ	INTF_MASK	= 0x0F		;      - External Interrupt Flags (4 bits)
.equ	INTF0		= 0		;          INTF BIT0 position



; ====	EEPROM MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EEAR bits		------------------------
.equ	EEAR_MASK	= 0x0FFF	;      - EEPROM Address bytes (12 bits)
.equ	EEAR0		= 0		;          EEAR BIT0 position

; ----------	Register EEDR bits		------------------------
.equ	EEDR_MASK	= 0xFF		;      - EEPROM Data Bits (8 bits)
.equ	EEDR0		= 0		;          EEDR BIT0 position

; ----------	Register EECR bits		------------------------
.equ	EEPM_MASK	= 0x30		;      - EEPROM Programming Mode (2 bits)
.equ	EEPM0		= 4		;          EEPM BIT0 position
.equ	EERIE		= 3		; 0x08 - EEPROM Ready Interrupt Enable
.equ	EEMWE		= 2		; 0x04 - EEPROM Master Write Enable
.equ	EEWE		= 1		; 0x02 - EEPROM Write Enable
.equ	EERE		= 0		; 0x01 - EEPROM Read Enable



; ====	AC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register AC0CON bits		------------------------
.equ	AC0EN		= 7		; 0x80 - Analog Comparator 0 Enable Bit
.equ	AC0IE		= 6		; 0x40 - Analog Comparator 0 Interrupt Enable Bit
.equ	AC0IS_MASK	= 0x30		;      - Analog Comparator 0  Interrupt Select Bit (2 bits)
.equ	AC0IS0		= 4		;          AC0IS BIT0 position
.equ	AC0M_MASK	= 0x07		;      - Analog Comparator 0 Multiplexer Register (3 bits)
.equ	AC0M0		= 0		;          AC0M BIT0 position

; ----------	Register AC2CON bits		------------------------
.equ	AC2EN		= 7		; 0x80 - Analog Comparator 2 Enable Bit
.equ	AC2IE		= 6		; 0x40 - Analog Comparator 2 Interrupt Enable Bit
.equ	AC2IS_MASK	= 0x30		;      - Analog Comparator 2  Interrupt Select Bit (2 bits)
.equ	AC2IS0		= 4		;          AC2IS BIT0 position
.equ	AC2M_MASK	= 0x07		;      - Analog Comparator 2 Multiplexer Register (3 bits)
.equ	AC2M0		= 0		;          AC2M BIT0 position
; ::::  AC2IS	:::: bitfield values
;			0x00		; Interrupt on Toggle
;			0x10		; Reserved
;			0x20		; Interrupt on Falling Edge
;			0x30		; Interrupt on Rising Edge

; ----------	Register ACSR bits		------------------------
.equ	ACCKDIV		= 7		; 0x80 - Analog Comparator Clock Divider
.equ	AC2IF		= 6		; 0x40 - Analog Comparator 2 Interrupt Flag Bit
.equ	AC1IF		= 5		; 0x20 - Analog Comparator 1  Interrupt Flag Bit
.equ	AC0IF		= 4		; 0x10 - Analog Comparator 0 Interrupt Flag Bit
.equ	AC2O		= 2		; 0x04 - Analog Comparator 2 Output Bit
.equ	AC1O		= 1		; 0x02 - Analog Comparator 1 Output Bit
.equ	AC0O		= 0		; 0x01 - Analog Comparator 0 Output Bit




